; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v2)
		(pred_3 ?v5)
		(pred_5 ?v6)
		(pred_4 ?v6)
		(pred_6 ?v5 ?v6)
		(pred_2)
		(pred_1 ?v5))

   (:action op_1
       :parameters  (?v1 ?v7)
       :precondition (and (not-eq ?v1 ?v7) 
                          (pred_5 ?v1) (pred_5 ?v7) (pred_4 ?v1))
       :effect (and  (pred_4 ?v7)
		     (not (pred_4 ?v1))))


   (:action op_2
       :parameters (?v4 ?v8)
       :precondition  (and  (pred_3 ?v4) (pred_5 ?v8)
			    (pred_6 ?v4 ?v8) (pred_4 ?v8) (pred_2))
       :effect (and (pred_1 ?v4)
		    (not (pred_6 ?v4 ?v8)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v4  ?v8)
       :precondition  (and  (pred_3 ?v4) (pred_5 ?v8)
			    (pred_1 ?v4) (pred_4 ?v8))
       :effect (and (pred_6 ?v4 ?v8)
		    (pred_2)
		    (not (pred_1 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_05 obj_02 
          obj_01 obj_04 obj_03 
)
(:init
(pred_5 obj_06)
(pred_5 obj_05)
(pred_5 obj_02)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_3 obj_03)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(pred_2)
(pred_6 obj_01 obj_05)
(pred_6 obj_04 obj_02)
(pred_6 obj_03 obj_06)
(pred_4 obj_05)
)
(:goal
(and
(pred_6 obj_01 obj_06)
(pred_6 obj_04 obj_05)
(pred_6 obj_03 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_01 obj_06) (pred_4 obj_02))
    (sometime-before  (pred_6 obj_04 obj_05) (pred_4 obj_06))
  )
)
)

; plan
1. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01 obj_05) (pred_2)
   added: (pred_1 obj_01)
   goals met: 1 of 3
2. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_02)
   goals met: 1 of 3
3. (op_3 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_6 obj_01 obj_02) (pred_2)
   goals met: 1 of 3
4. (op_2 obj_04 obj_02)
   deleted: (pred_6 obj_04 obj_02) (pred_2)
   added: (pred_1 obj_04)
   goals met: 1 of 3
5. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 1 of 3
6. (op_3 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_6 obj_04 obj_06) (pred_2)
   goals met: 1 of 3
7. (op_1 obj_06 obj_02)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_02)
   goals met: 1 of 3
8. (op_2 obj_01 obj_02)
   deleted: (pred_6 obj_01 obj_02) (pred_2)
   added: (pred_1 obj_01)
   goals met: 1 of 3
9. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 1 of 3
10. (op_3 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_6 obj_01 obj_06) (pred_2)
   goals met: 2 of 3
11. (op_2 obj_04 obj_06)
   deleted: (pred_6 obj_04 obj_06) (pred_2)
   added: (pred_1 obj_04)
   goals met: 2 of 3
12. (op_1 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_05)
   goals met: 2 of 3
13. (op_3 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_6 obj_04 obj_05) (pred_2)
   goals met: 3 of 3
